# Importing NumPy, Pandas

In [2]:
import numpy as np
import pandas as pd

# Simple Usage of Pandas, Framework

In [3]:
# making a dictionary here 
dict1 = {
    "name" : ["atif", "arjit", "vitalsigns", "eminem", "akon"],
    "narks" : [34,56,78,89,90],
    "city": ["lahore", "delhi", "faisalabad", "newyork", "brazil"]
}

In [4]:
# made the dataframe - for faster indexing it made it like an excel sheet
# so you can analyze the data more correctly - big data
df1 = pd.DataFrame(dict1)

In [5]:
df1

         name  narks        city
0        atif     34      lahore
1       arjit     56       delhi
2  vitalsigns     78  faisalabad
3      eminem     89     newyork
4        akon     90      brazil

In [6]:
# for exporting this dataframe into excel/csv
df1.to_csv('tempdata.csv')

In [7]:
# if you don't want to include the index
df1.to_csv("tempdata_false_again.csv", index=False)

In [8]:
# starting n rows
df1.head(2)

    name  narks    city
0   atif     34  lahore
1  arjit     56   delhi

In [9]:
# end n rows
df1.tail(2)

     name  narks     city
3  eminem     89  newyork
4    akon     90   brazil

In [10]:
# it runs only on the numerical values, will do the statistical analysis
df1.describe()

           narks
count   5.000000
mean   69.400000
std    24.058263
min    34.000000
25%    56.000000
50%    78.000000
75%    89.000000
max    90.000000

In [11]:
# for reading any csv
red = pd.read_csv("tempdata_false_again.csv")

In [12]:
red

         name  narks        city
0        atif     34      lahore
1       arjit     56       delhi
2  vitalsigns     78  faisalabad
3      eminem     89     newyork
4        akon     90      brazil

In [13]:
# for getting the specific column
red['name']

0          atif
1         arjit
2    vitalsigns
3        eminem
4          akon
Name: name, dtype: object

In [14]:
# for gettign the column with specific index
red['narks'][0]

34

In [15]:
# for changing the index
# red.index = ['first', 'second', 'third', 'fourth', 'fifth']

In [17]:
# Pandas has basically 2 types of Data Structures:
# Series: 1D-array for holding similar types of data
# DataFrame: 1D-array for holding the different types of data

type(red['narks'])
type(red)

pandas.core.frame.DataFrame

# Making Difference between Series and Dataframe